CF/DataProcessors/РаботаСПравиламиИменованияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РаботаСПравиламиИменованияНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

CF/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАлкогольнойПродукцииЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортнаяАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборУпаковок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемДАЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводДробногоКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСерийногоНомера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерийныхНомеровСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияМаркируемаяДляГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМВид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМСпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборотГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМРазмер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМехаГИСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМехаГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/DataProcessors/РаботаСПравиламиИменованияНоменклатуры/Forms/РедактированиеНаименования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПравилоИменования = Параметры.Правило;	
	Номенклатура = Параметры.Номенклатура;
	
	МассивПараметровПравила = Новый Массив;
	Для Каждого СтрокаПараметр из Параметры.ПараметрыПравилаИменования Цикл				
		ЗаполнитьЗначенияСвойств(ПараметрыПравилаИменования.Добавить(),СтрокаПараметр);	
		МассивПараметровПравила.Добавить(Новый РеквизитФормы(СтрокаПараметр.ПутьКДанным,СтрокаПараметр.ТипРеквизита,,СтрокаПараметр.ИмяПараметра));	
	КонецЦикла;	
	ЭтаФорма.ИзменитьРеквизиты(МассивПараметровПравила);
	
	Если Параметры.Свойство("ЗначенияПараметровИменования") Тогда
		Для Каждого СтрокаПараметр из ПараметрыПравилаИменования Цикл
			СтрокиЗначенияПараметров = Параметры.ЗначенияПараметровИменования.НайтиСтроки(Новый Структура("ПутьКДанным",СтрокаПараметр.ПутьКДанным));
			Если СтрокиЗначенияПараметров.Количество() > 0 Тогда 
				ЭтаФорма[СтрокаПараметр.ПутьКДанным] = СтрокиЗначенияПараметров[0].Значение;
				СтрокаПараметр.ДанныеПараметраСтрокой = Формат(СтрокиЗначенияПараметров[0].Значение,"ДЛФ=Д; БЛ='Ложь'; БИ='" + СтрокаПараметр.ИмяПараметра + "'");
			КонецЕсли;
		КонецЦикла;
	Иначе
		РезультатЗапроса = РаботаСПравиламиИменования.ПолучитьЗначенияПараметровНоменклатуры(Номенклатура.ВидНоменклатуры,ПараметрыПравилаИменования,Номенклатура);
		ВыборкаДанных 	 = РезультатЗапроса.Выбрать();
		Если ВыборкаДанных.Количество() > 0 Тогда 
			ВыборкаДанных.Следующий(); 
			Для Каждого СтрокаПараметр из ПараметрыПравилаИменования Цикл
				ЭтаФорма[СтрокаПараметр.ПутьКДанным] = ВыборкаДанных[СтрокаПараметр.ИмяЭлемента];
				СтрокаПараметр.ДанныеПараметраСтрокой = Формат(ЭтаФорма[СтрокаПараметр.ПутьКДанным],"ДЛФ=Д; БЛ='Ложь'; БИ='" + СтрокаПараметр.ИмяПараметра + "'");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	РаботаСПравиламиИменования.ДобавитьЭлементыПравилаИменования(ЭтаФорма,Элементы.ГруппаПараметрыИменования);
	
	РеквизитыНоменклатуры = Метаданные.Справочники.Номенклатура.Реквизиты;
	
	Для Каждого СтрокаПараметр из ПараметрыПравилаИменования Цикл
		Если СтрокаПараметр.ЭтоДопРеквизит Тогда
			Если СтрокаПараметр.Свойство.ЗаполнятьОбязательно Тогда
				СтрокаПараметр.ПроверятьЗаполнение = Истина;
			Иначе
				Элементы[СтрокаПараметр.ИмяЭлемента].АвтоОтметкаНезаполненного = Ложь;
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ЭтоДопСведение Тогда
			Элементы[СтрокаПараметр.ИмяЭлемента].АвтоОтметкаНезаполненного = Ложь;
		Иначе
			Если СтрокаПараметр.ПутьКДанным = "ВидНоменклатуры" Тогда
				Элементы[СтрокаПараметр.ИмяЭлемента].ТолькоПросмотр = Истина;
			ИначеЕсли СтрокаПараметр.ПутьКДанным = "СтавкаНДС" Тогда
				Элементы[СтрокаПараметр.ИмяЭлемента].РежимВыбораИзСписка = Истина;
				Элементы[СтрокаПараметр.ИмяЭлемента].СписокВыбора.Добавить(УчетНДС.СтавкаНДСПоУмолчанию(ТекущаяДатаСеанса()));
				Элементы[СтрокаПараметр.ИмяЭлемента].СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
				Элементы[СтрокаПараметр.ИмяЭлемента].СписокВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС);
			КонецЕсли;
			РеквизитНоменклатуры = РеквизитыНоменклатуры[СтрокаПараметр.ПутьКДанным];
			Если РеквизитНоменклатуры.ПроверкаЗаполнения = ПроверкаЗаполнения.НеПроверять Тогда
				Элементы[СтрокаПараметр.ИмяЭлемента].АвтоОтметкаНезаполненного = Ложь;
			Иначе
				СтрокаПараметр.ПроверятьЗаполнение = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
			
	СформироватьНаименование();
	ПоискДублей();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	МассивНеЗаполненныхПараметров = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ДанныеПараметраСтрокой",""));
	Если МассивНеЗаполненныхПараметров.Количество() = 0 Тогда
		ЗакрытьФорму();
	Иначе
		МассивНеЗаполненныхОбязательныхПараметров = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ДанныеПараметраСтрокой,ПроверятьЗаполнение","",Истина));
		Если МассивНеЗаполненныхОбязательныхПараметров.Количество() > 0 Тогда
			Для Каждого СтрокаПараметр из МассивНеЗаполненныхОбязательныхПараметров Цикл
				ТекстСообщения =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено.'"),СтрокаПараметр.ИмяПараметра);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,СтрокаПараметр.ПутьКДанным);
			КонецЦикла;
		Иначе
			ТекстВопроса = НСтр("ru = 'Некоторые параметры именования не заполнены. Продолжить?'");
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросЗавершение", ЭтаФорма);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПараметрИменованияПриИзменении(Элемент)
	
	Строки = ПараметрыПравилаИменования.НайтиСтроки(Новый Структура("ИмяЭлемента",Элемент.Имя));	
	Для Каждого Строка из Строки Цикл
		Строка.ДанныеПараметраСтрокой = Формат(ЭтаФорма[Строка.ПутьКДанным],"ДЛФ=Д; БЛ='Ложь'; БИ='" + Строка.ИмяПараметра + "'");
	КонецЦикла;
	
	СформироватьНаименование();	
	ПоискДублей();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИнформацияДублирующиеПозицииНажатие(Элемент)
	
	МассивДублирующихПозиций = Новый Массив;
	
	Для Каждого Строка Из ДублиНоменклатуры Цикл
		МассивДублирующихПозиций.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивДублирующихПозиций",МассивДублирующихПозиций);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСпискаДублирующиеПозиции",ПараметрыОткрытия,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаименование()
	
	Элементы.ДекорацияПримерНаименования.Заголовок = РаботаСПравиламиИменованияКлиентСервер.ПреобразоватьСтрокуПоПравилу(ПравилоИменования,ПараметрыПравилаИменования,"ИмяПараметра","ДанныеПараметраСтрокой");
		
КонецПроцедуры

&НаСервере
Процедура ПоискДублей()

	ДублиНоменклатуры.Очистить();

	СтруктураПоискаДублей = РаботаСПравиламиИменования.ПолучитьСтруктуруПоискаНоменклатуры(ЭтаФорма);
	
	Если СтруктураПоискаДублей.РеквизитыЗаполнены Тогда		
		СтруктураПоискаДублей.Вставить("ВидНоменклатуры",Номенклатура.ВидНоменклатуры);
		Результат = РаботаСПравиламиИменования.ПоискНоменклатуры(СтруктураПоискаДублей,Номенклатура);
		Выборка   = Результат.Выбрать();
		
		КоличествоДублирующихПозиций = Выборка.Количество(); 
		Элементы.НадписьИнформацияДублирующиеПозиции.Заголовок = "Обнаружены карточки с одинаковым наименованием (" + КоличествоДублирующихПозиций + ")";
		Элементы.НадписьИнформацияДублирующиеПозиции.Видимость = КоличествоДублирующихПозиций > 0;	
		
		Пока Выборка.Следующий() Цикл
			НСтр = ДублиНоменклатуры.Добавить();
			НСтр.Номенклатура = Выборка.Номенклатура;
		КонецЦикла;

	Иначе 
		Элементы.НадписьИнформацияДублирующиеПозиции.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросЗавершение(Результат, ПараметрКоманды) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	ПараметрыЗакрытия			= Новый Структура;
	МассивЗаполненныхПараметров	= Новый Массив;
	
	Для Каждого СтрокаПараметр из ПараметрыПравилаИменования Цикл
		
		СтруктураПараметра = Новый Структура;
		
		Если СтрокаПараметр.ЭтоДопРеквизит Тогда
			СтруктураПараметра.Вставить("ДанныеОбъекта",Ложь);
		ИначеЕсли СтрокаПараметр.ЭтоДопСведение Тогда
			ЗаписатьДопСведение(СтрокаПараметр.Свойство,ЭтаФорма[СтрокаПараметр.ПутьКДанным]); 
			СтруктураПараметра.Вставить("ЭтоДопСведение");	
		Иначе
			СтруктураПараметра.Вставить("ДанныеОбъекта",Истина);
		КонецЕсли;
		
		СтруктураПараметра.Вставить("ПутьКДанным",	СтрокаПараметр.ПутьКДанным);
		СтруктураПараметра.Вставить("Значение",		ЭтаФорма[СтрокаПараметр.ПутьКДанным]);
		
		МассивЗаполненныхПараметров.Добавить(СтруктураПараметра);
		
	КонецЦикла;
	
	ПараметрыЗакрытия.Вставить("Наименование",Элементы.ДекорацияПримерНаименования.Заголовок);
	ПараметрыЗакрытия.Вставить("МассивЗаполненныхПараметров",МассивЗаполненныхПараметров);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДопСведение(Свойство,Значение)
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Номенклатура;
	МенеджерЗаписи.Свойство = Свойство;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать();
			
КонецПроцедуры

#КонецОбласти
